//桌子制程匹配
var isSubmit = false;
var hgx_port = fortest?'8896':'8893';
window.socket = io.connect('https://www.kenta.cn:8892');
socket.on('connect', function (response) {
	console.log('ws已连接')
});
var socket2 = io.connect('https://www.kenta.cn:'+hgx_port);

socket.on('postidReturn', function (response) {      
    global_json = response;
    var html = response.formhtml.slice(0,-6)+'<div classname="field"><p>'+response.other+'</p></div><div class="fluid ui submit button" onclick="FormSubmit()">提交</div><div class="ui error message"></div></div>';
    // console.log(html);       
    $('#formtitle').html(response.title);
    $('#formdescription').html(response.description);
    $('#display').html(html);
    $('.ui.dropdown').dropdown();
    $('.ui.form.first').form({            
        fields:global_json.fields
    }); 
    _.map(process,function(n){
        $('#制程名称').append('<option class="item" value="'+n.制程代号+'-'+n.制程名称+'">'+n.制程代号+'-'+n.制程名称+'</option>');
    }) 
    socket2.emit('storeClientInfo', ['QueryTableRelation']);
});

socket.on('collecteddatawritedReturn', function (response) {
    if(response == 'errormsg') {
        alert('数据写入失败,请检查!');
    }else {
        console.log('写入')
        $.get("https://www.kenta.cn:"+hgx_port+"/type=callfunction?dataname=QueryTableRelation", function(response) {},'json');           
    }
}) 

socket2.on('getnewjson', function (msg) {  
    console.log('msg',msg);      
    if(msg.QueryTableRelation != undefined) {                
        if(isSubmit) {            
            alert("提交成功")
            $('#myloader').removeClass('ui active inverted dimmer');
            isSubmit = false;
        }        
    }
});

//万一卡socket返回 就自动去掉loading
function intervarCheck() {
    setTimeout(function(){
        if(isSubmit) {        
            isSubmit = false;
            $.get('https://www.kenta.cn:8893/type=getdata?dataname=后工序总MO列表',function(n){
                后工序总MO列表 = n; 
            },'json');
            alert('提交成功！');
            $('#myloader').removeClass('active');
        }
    },3000)
}

function RenderForm(id) {
    currentUser.loginrequired = true;
    var allowed = ['jiaming.liu','ricky.ngai','xiaoyu.ye'];
    currentUser.loginrequired = true;  
    if(currentUser.loginrequired == true && currentUser.user_name == '') {        
        $('#formwindow').attr('class','ui segment none');
        $('#login').attr('class','ui form');
    }else { 
        if(currentUser.loginrequired == true) {
            console.log(currentUser)
            // if(allowed.indexOf(currentUser.user_name)==-1) {
            //     alert('您没有权限访问此页!');
            //     return false;
            // }   
        }       
        $('#formwindow').attr('class','ui segment');
        $('#login').attr('class','none');
        socket.emit('postid', id);
    }    
}

 
    var process =[
      {制程代号: "C001", 制程名称: "注塑成型"}
    , {制程代号: "C00101", 制程名称: "放五金"}
    , {制程代号: "C00102", 制程名称: "注塑成型"}
    , {制程代号: "C00103", 制程名称: "配料"}
    , {制程代号: "C002", 制程名称: "注塑加工"}
    , {制程代号: "C00201", 制程名称: "车床"}
    , {制程代号: "C00202", 制程名称: "攻牙"}
    , {制程代号: "C00203", 制程名称: "喷砂"}
    , {制程代号: "C00204", 制程名称: "加工披锋"}
    , {制程代号: "C00205", 制程名称: "切水口"}
    , {制程代号: "C00206", 制程名称: "整形"}
    , {制程代号: "C00207", 制程名称: "摆盘"}
    , {制程代号: "C00208", 制程名称: "滚砂"}
    , {制程代号: "C00209", 制程名称: "烘烤"}
    , {制程代号: "C00210", 制程名称: "冲切五金"}
    , {制程代号: "C00211", 制程名称: "擦油"}
    , {制程代号: "C00212", 制程名称: "擦产品"}
    , {制程代号: "C00213", 制程名称: "研磨"}
    , {制程代号: "C003", 制程名称: "注塑组装"}
    , {制程代号: "C00301", 制程名称: "放五金"}
    , {制程代号: "C00302", 制程名称: "打螺丝"}
    , {制程代号: "C00303", 制程名称: "组装"}
    , {制程代号: "C00304", 制程名称: "压五金"}
    , {制程代号: "C00305", 制程名称: "贴膜"}
    , {制程代号: "C004", 制程名称: "注塑全检"}
    , {制程代号: "C00401", 制程名称: "功能性测试"}
    , {制程代号: "C00402", 制程名称: "尺寸检测"}
    , {制程代号: "C00403", 制程名称: "外观全检"}
    , {制程代号: "C00404", 制程名称: "加工全检"}
    , {制程代号: "C005", 制程名称: "注塑包装"}
    , {制程代号: "C00501", 制程名称: "半成品包装"}
    , {制程代号: "C00502", 制程名称: "成品包装"}
    , {制程代号: "C006", 制程名称: "插五金"}
    , {制程代号: "C00601", 制程名称: "自动插五金"}
    , {制程代号: "C00701", 制程名称: "收料"}
    , {制程代号: "C00702", 制程名称: "烤料"}
    , {制程代号: "C00703", 制程名称: "上模"}
    , {制程代号: "C00704", 制程名称: "注塑作业自检"}
    , {制程代号: "C00705", 制程名称: "半成品入庫"}
    , {制程代号: "C00706", 制程名称: "拆卸模具"}
    , {制程代号: "C00707", 制程名称: "退料"}
    , {制程代号: "J001", 制程名称: "插针"}
    , {制程代号: "J00101", 制程名称: "插针机插针"}
    , {制程代号: "J00102", 制程名称: "手啤机插针"}
    , {制程代号: "J00103", 制程名称: "气动插针机插针"}
    , {制程代号: "J002", 制程名称: "插针后加工"}
    , {制程代号: "J00201", 制程名称: "切断"}
    , {制程代号: "J00202", 制程名称: "打弯"}
    , {制程代号: "J00203", 制程名称: "加工披锋"}
    , {制程代号: "J00204", 制程名称: "切水口"}
    , {制程代号: "J00205", 制程名称: "切假PIN"}
    , {制程代号: "J00206", 制程名称: "喷砂"}
    , {制程代号: "J00207", 制程名称: "整形"}
    , {制程代号: "J00208", 制程名称: "摆吸塑盘"}
    , {制程代号: "J00209", 制程名称: "放五金"}
    , {制程代号: "J00210", 制程名称: "冲床"}
    , {制程代号: "J00211", 制程名称: "研磨"}
    , {制程代号: "J00212", 制程名称: "擦油"}
    , {制程代号: "J00213", 制程名称: "半自动冲切"}
    , {制程代号: "J003", 制程名称: "插针浸锡"}
    , {制程代号: "J00301", 制程名称: "浸锡"}
    , {制程代号: "J00302", 制程名称: "吹锡屑"}
    , {制程代号: "J004", 制程名称: "插针组装"}
    , {制程代号: "J00401", 制程名称: "外壳刷油"}
    , {制程代号: "J00402", 制程名称: "黑白导线"}
    , {制程代号: "J00403", 制程名称: "蓝色导线"}
    , {制程代号: "J00404", 制程名称: "黑黄导线"}
    , {制程代号: "J00405", 制程名称: "蓝红导线"}
    , {制程代号: "J00406", 制程名称: "黑色导线"}
    , {制程代号: "J00407", 制程名称: "套热缩管"}
    , {制程代号: "J00408", 制程名称: "套套管"}
    , {制程代号: "J00409", 制程名称: "压端子"}
    , {制程代号: "J00410", 制程名称: "插护套"}
    , {制程代号: "J00411", 制程名称: "测推力"}
    , {制程代号: "J00412", 制程名称: "安装扭簧"}
    , {制程代号: "J00413", 制程名称: "钢珠外壳机"}
    , {制程代号: "J00414", 制程名称: "触板弹簧机"}
    , {制程代号: "J00415", 制程名称: "接线盘刷油"}
    , {制程代号: "J00416", 制程名称: "安装接线盘"}
    , {制程代号: "J00417", 制程名称: "功能检测"}
    , {制程代号: "J00418", 制程名称: "贴海绵条"}
    , {制程代号: "J00419", 制程名称: "插脚座刷油"}
    , {制程代号: "J00420", 制程名称: "安装插脚座"}
    , {制程代号: "J00421", 制程名称: "插静触点"}
    , {制程代号: "J00422", 制程名称: "旋铆1道"}
    , {制程代号: "J00423", 制程名称: "旋铆2道"}
    , {制程代号: "J00424", 制程名称: "焊锡1道"}
    , {制程代号: "J00425", 制程名称: "旋铆3道"}
    , {制程代号: "J00426", 制程名称: "旋铆4道"}
    , {制程代号: "J00427", 制程名称: "焊锡2道"}
    , {制程代号: "J00428", 制程名称: "安装插件护套"}
    , {制程代号: "J00429", 制程名称: "焊锡3道"}
    , {制程代号: "J00430", 制程名称: "安装上下触板"}
    , {制程代号: "J00431", 制程名称: "触片座总成全检"}
    , {制程代号: "J00432", 制程名称: "裁线"}
    , {制程代号: "J005", 制程名称: "后工序全检"}
    , {制程代号: "J00501", 制程名称: "功能性测试"}
    , {制程代号: "J00502", 制程名称: "尺寸检测"}
    , {制程代号: "J00503", 制程名称: "请用J00718"}
    , {制程代号: "J00504", 制程名称: "CCD检测"}
      , {制程代号: "J00505", 制程名称: "治具检查"}
, {制程代号: "J00506", 制程名称: "分穴号"}
, {制程代号: "J00507", 制程名称: "测导通"}
, {制程代号: "J00508", 制程名称: "测内PIN"}
, {制程代号: "J00509", 制程名称: "测外PIN"}
, {制程代号: "J00510", 制程名称: "显微镜检查"}
, {制程代号: "J00511", 制程名称: "密封测试"}
, {制程代号: "J00512", 制程名称: "测垂直度"}
, {制程代号: "J00513", 制程名称: "电脑检测"}
, {制程代号: "J00514", 制程名称: "过治具"}
, {制程代号: "J00515", 制程名称: "检平面度"}
, {制程代号: "J00516", 制程名称: "数PIN"}
, {制程代号: "J00517", 制程名称: "强度测试，研磨水口"}
, {制程代号: "J00518", 制程名称: "测圆跳动"}
, {制程代号: "J006", 制程名称: "插针(包装)"}
, {制程代号: "J00601", 制程名称: "半成品包装"}
, {制程代号: "J00602", 制程名称: "成品包装"}
, {制程代号: "J00701", 制程名称: "插针5道"}
, {制程代号: "J00702", 制程名称: "摆纸板"}
, {制程代号: "J00703", 制程名称: "摆盘"}
, {制程代号: "J00704", 制程名称: "二次整形"}
, {制程代号: "J00705", 制程名称: "已作废"}
, {制程代号: "J00706", 制程名称: "测高压"}
, {制程代号: "J00707", 制程名称: "擦油2道"}
, {制程代号: "J00708", 制程名称: "过针脚板"}
, {制程代号: "J00709", 制程名称: "测显微镜"}
, {制程代号: "J00710", 制程名称: "插针2道"}
, {制程代号: "J00711", 制程名称: "擦油1道"}
, {制程代号: "J00712", 制程名称: "刷锡屑"}
, {制程代号: "J00713", 制程名称: "测平面度"}
, {制程代号: "J00714", 制程名称: "插五金"}
, {制程代号: "J00715", 制程名称: "压手啤"}
, {制程代号: "J00716", 制程名称: "加工半成品"}
, {制程代号: "J00717", 制程名称: "过内PIN"}
, {制程代号: "J00718", 制程名称: "全检"}
, {制程代号: "J00719", 制程名称: "冲压"}
, {制程代号: "J00720", 制程名称: "过治具2道"}
, {制程代号: "J00721", 制程名称: "组装"}
, {制程代号: "J00722", 制程名称: "剪断"}
, {制程代号: "J00723", 制程名称: "插针包装"}
, {制程代号: "J00724", 制程名称: "加工行位"}
, {制程代号: "J00725", 制程名称: "吹气"}
, {制程代号: "J00726", 制程名称: "插针3道"}
, {制程代号: "J00727", 制程名称: "插针4道"}
, {制程代号: "J00728", 制程名称: "剪水口"}
, {制程代号: "J00729", 制程名称: "插针1道"}
, {制程代号: "J00730", 制程名称: "测长短PIN"}
, {制程代号: "J00731", 制程名称: "静电除尘"}
, {制程代号: "J00732", 制程名称: "压手啤2道"}
, {制程代号: "J00733", 制程名称: "掰五金"}
, {制程代号: "J00734", 制程名称: "二次全检"}
, {制程代号: "J00735", 制程名称: "打弯2道"}
, {制程代号: "J00736", 制程名称: "摆纸板1"}
, {制程代号: "J00737", 制程名称: "浸锡1"}
, {制程代号: "J00738", 制程名称: "半成品倉儲"}
, {制程代号: "J00739", 制程名称: "插针领料"}
, {制程代号: "J00740", 制程名称: "上模"}
, {制程代号: "J00741", 制程名称: "CP线安装"}
, {制程代号: "J00742", 制程名称: "退火烘烤"}
, {制程代号: "J00743", 制程名称: "时效存储"}
, {制程代号: "J00744", 制程名称: "工作面研磨"}
, {制程代号: "J00745", 制程名称: "成品清洗"}
, {制程代号: "J00746", 制程名称: "脱水烘干"}
, {制程代号: "J00747", 制程名称: "摆盘2"}
, {制程代号: "J00748", 制程名称: "压五金"}
, {制程代号: "J00749", 制程名称: "过治具3道"}
, {制程代号: "J00750", 制程名称: "热熔"}
, {制程代号: "J00751", 制程名称: "自动插五金"}
, {制程代号: "J00752", 制程名称: "冲压2"}
, {制程代号: "J00753", 制程名称: "切五金"}
, {制程代号: "J00754", 制程名称: "加湿"}
, {制程代号: "J00755", 制程名称: "打点"}
, {制程代号: "J00756", 制程名称: "自动冲压电测"}
, {制程代号: "W001", 制程名称: "产品外发"}
, {制程代号: "W00101", 制程名称: "外发包装"}
, {制程代号: "W00102", 制程名称: "外发印刷、丝印"}
, {制程代号: "W00103", 制程名称: "外发喷漆"}
, {制程代号: "W00104", 制程名称: "外发电镀"}
, {制程代号: "W00105", 制程名称: "外发注塑生产"}
, {制程代号: "W00106", 制程名称: "EED"}
, {制程代号: "W00107", 制程名称: "外发倒角"}
, {制程代号: "W00108", 制程名称: "外发车削"}
, {制程代号: "W00109", 制程名称: "外发加工水口"}
, {制程代号: "W00110", 制程名称: "外发冲断"}
, {制程代号: "W002", 制程名称: "外发抽粒"}
, {制程代号: "W003", 制程名称: "外发全检"}
, {制程代号: "W004", 制程名称: "外发生产"}
, {制程代号: "W005", 制程名称: "外发配色"}
, {制程代号: "W006", 制程名称: "外发改性"}
, {制程代号: "W007", 制程名称: "外发辐射照明"}
, {制程代号: "W008", 制程名称: "外发机加工"}
, {制程代号: "W009", 制程名称: "外发贴膜"}
, {制程代号: "W010", 制程名称: "外发电泳"}
, {制程代号: "W011", 制程名称: "外发冲切"}]
     
jQuery(function(){
  //输入框的值改变时触发
  $("#制程名称").on("select",function(e){
    var queryList = this.props.course.queryList;
    var list = [];
    var val = e.target.value;
    if (queryList != undefined && queryList != null && queryList.length != 0) {
        for (var i = 0; i < queryList.length; i++) {
            var num = queryList[i].menuFullName.indexOf(val);
            if (num != -1) {
                list.push(queryList[i]);
            }
        }
    }
  });
});




function FormSubmit() {    
    var allrequired = $('.ui.form.first').form('is valid'); 
    console.log('1层表单',allrequired)
    if(allrequired==false) {                  
      return false;
    } 
    $('#myloader').addClass('ui active inverted dimmer');

    $.ajax({                
      type:"GET",
      url:"https://www.kenta.cn:"+hgx_port+"/type=getdata?dataname=桌子状态",
      async:false,
      dataType:'json',
      success:function(桌子状态){  
        var processName=$("#制程名称 option:selected").val(); //获取选中的项
        var tableCode = $("#桌子编号").val();
        var obj ={}
        obj.桌子编号=tableCode;
        obj.制程名称=processName;
        console.log("上传数据",obj);
        var selected = _.filter(桌子状态,{桌号:tableCode});
        if(selected.length>0) {
          if(selected[0].正在生产中产品) {
            alert('当前桌子有产品在生产,不能更改工序!');
            $('#myloader').removeClass('ui active inverted dimmer');
            return false;
          }
        }
        var post = {
            title: global_json.title,
            description: global_json.description,
            formtag:global_json.formtag,
            type: "collecteddata",
            username: currentUser.user_name,
            poststatus:'abled',
            templateid:'5d28254871e7a243849213b0',
            collectedData: obj,            
            createTime: moment().format('YYYY-MM-DD HH:mm:ss'),
            lastUpdateTime: moment().format('YYYY-MM-DD HH:mm:ss'),
            fortest:fortest
        };  
        isSubmit = true;
        socket.emit('collecteddata', post);    
        intervarCheck()    
      }
    },'json');
}

